In [48]:
import pandas as pd

In [49]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [50]:
df.drop(["PassengerId","Name","SibSp","Parch","Ticket","Cabin","Embarked"],axis=1,inplace=True)

In [51]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [52]:
X = df.drop(["Survived"],axis=1)

In [53]:
X.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [54]:
y = df["Survived"]

In [55]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [56]:
dummies = pd.get_dummies(df.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [57]:
X = pd.concat([X,dummies],axis=1)

In [58]:
X.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [59]:
X.drop(["Sex","male"],axis=1,inplace=True)

In [60]:
X.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [62]:
X.describe()

           Pclass         Age        Fare      female
count  891.000000  714.000000  891.000000  891.000000
mean     2.308642   29.699118   32.204208    0.352413
std      0.836071   14.526497   49.693429    0.477990
min      1.000000    0.420000    0.000000    0.000000
25%      2.000000   20.125000    7.910400    0.000000
50%      3.000000   28.000000   14.454200    0.000000
75%      3.000000   38.000000   31.000000    1.000000
max      3.000000   80.000000  512.329200    1.000000

In [63]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    int64
 1   Age     714 non-null    float64
 2   Fare    891 non-null    float64
 3   female  891 non-null    uint8
dtypes: float64(2), int64(1), uint8(1)
memory usage: 21.9 KB

In [67]:
X["Age"].fillna(29,inplace=True)

In [69]:
X.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [70]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2)

In [71]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [72]:
model.fit(X_train,y_train)

GaussianNB()

In [73]:
model.score(X_test,y_test)

0.7597765363128491

In [74]:
X_test[:10]

     Pclass   Age     Fare  female
555       1  62.0  26.5500       0
675       3  18.0   7.7750       0
706       2  45.0  13.5000       1
245       1  44.0  90.0000       0
661       3  40.0   7.2250       0
309       1  30.0  56.9292       1
301       3  29.0  23.2500       0
330       3  29.0  23.2500       1
476       2  34.0  21.0000       0
878       3  29.0   7.8958       0

In [75]:
y_test[:10]

555    0
675    0
706    1
245    0
661    0
309    1
301    1
330    1
476    0
878    0
Name: Survived, dtype: int64

In [77]:
model.predict(X_test[0:10])

array([0, 0, 1, 1, 0, 1, 0, 1, 0, 0], dtype=int64)

In [78]:
model.predict_proba(X_test[:10])

array([[0.63762478, 0.36237522],
       [0.96126471, 0.03873529],
       [0.20607497, 0.79392503],
       [0.31130127, 0.68869873],
       [0.9658894 , 0.0341106 ],
       [0.03714668, 0.96285332],
       [0.96577496, 0.03422504],
       [0.38517736, 0.61482264],
       [0.9262124 , 0.0737876 ],
       [0.96646006, 0.03353994]])

In [79]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train,y_train,cv=5)

array([0.76923077, 0.77622378, 0.76760563, 0.78873239, 0.78873239])